Revit 2027 API
ParameterTypeId.RoutingPreferenceParam Property
 "Routing Preference"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoutingPreferenceParam { get; }
Public Shared ReadOnly Property RoutingPreferenceParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoutingPreferenceParam {
	ForgeTypeId^ get ();
}
static member RoutingPreferenceParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace